Revit 2024 API
TemporaryViewModes.DeactivateAllModes Method
 Deactivates all temporary modes that are currently active.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016 Subscription Update
Syntax
C#
public void DeactivateAllModes()
Visual Basic
Public Sub DeactivateAllModes
Visual C++
public:
void DeactivateAllModes()
See Also
TemporaryViewModes Class
Autodesk.Revit.DB Namespace